[
    {
        "filename": "resume_raw.md",
        "content": "# Resume Text\n\n```\nKRISHNA PURWAR\nELECTRONICS ENGINEER\nHARDWARE PROJECTS\nAutomated Smart Adaptive Parking Systems (ASAP)\n ASAP is an advanced solution for modern-day parking problems, offering a completely labor-free, automated \nprocess from reaching the parking lot to parking the vehicle and exiting. The prototype utilizes a vehicle number recognition system\nthrough a Python script using OpenCV, along with simultaneous communication with Arduino, IR sensors, and Raspberry Pi.\nAdditionally, it includes the development of a website for pre- booking parking slots.\nRiver-Cleaning Bot\nDeveloped a Sustainable River cleaning bot by completely repurposing the waste materials like tyre tubes, waste plastics, etc and\nadditionally adding features like remote controlled operation, conveyor belt system, chlorine sprinkler and digital analyser that\ndetects parameters and sends via internet and has a capacity to hold 3-4 Kgs of waste.\nSmart Wearable Device for Soldiers\nA smart device, wearable around a forearm that ensures secure communication of ground station and soldier via 433MHz LoRa\nmodules, send commands, body vitals and environmental parameters and receive commands and display it over .96 OLED.\nCenturio Game Deck is a Bluetooth-controlled gaming controller built using Arduino, joysticks, Bluetooth modules, and a Python\nscript that translates hardware input to game-level output.\nOther projects include Project Nandi, a quadruped robot developed for a hackathon, Bit reader- A smart and customised QR code\nscanner, automated/Manual Pesticide Sprayer that can be controlled via phone, the assembly and flying of a drone at IISc\nBangalore, and many other projects.\nCenturio Game Deck\nAI- driven Medicine Dispenser\nMedicine dispenser using Face-recognition to provide medicines at the right time along with phone notification system- designed\nfor mental asylums, homes, etc.\nTECHNICAL SKILLS\nEmbedded C \nTI MSP430 Microcontroller\n Arduino/ Rasberry pi/ ESP32/STM32\nAltium/pspice/Proteus\nHTML, CSS, JAVAscript\nJAVA/Python/Django\nSolidworks (CAD) \nBasic Electronics\nSOFTWARE PROJECTS\nMedHelp - AI-powered clinic management system with 85% accurate symptom analysis and reduced wait times..\nPrixx - A highly dynamic student placement preparation website focusing on tech/non-tech and core domains and companies, AI\nassisted Interview and analyser and question practising, using tech like HTML/CSS/JS, MySQL, LangChain,  Django, etc.\nProject ENIGMA - A simple, creative and useful website which is a generative AI project which used GPT-3.5 using Flask and HTML as\nits user Interface to summarize academic content such as Videos, PDFs and other documents.\nDevelopment of the home page of the E-summit website of RVCE.\nMy Linkedin: www.linkedin.com/in/krishna-purwar-b84810281\n2008-2022\nEDUCATION\nSaint Dominic Savio college, Lucknow \n~Class X (ICSE) - 96.8% \n~Class XII (ISC) - 93%\nBachelor of Engineering in ELECTRONICS AND INSTRUMENTAION ENGINEERING at RVCE Bangalore \n~Grade - 9.33 GPA\n2023-2027\nEXPERIENCE\n- August to October 2023\n-December 2023 to Present\nWorked as a Content Intern in MathanGo \nDisplayed skills in soft communication, public speaking, content tagging, and team development,\nsignificantly enhancing my experience and practical approach in the corporate world.\nTechnical Member in Team Antariksh, RVCE\nMember at Telemetry subsystem and Power systems developing a High-Altitude Pseudo-satellite\nPlatform, along with that, sponsorship executive for the Team.\nConduction of events and handling operations within the society.\nSecretory - IEEE Rvce Sensors Society\n-January 2025 to Present\n```"
    },
    {
        "filename": "resume_raw1.md",
        "content": "# Resume Text\n\n```\nHayden Smith  \n214 Mitre Avenue, Park Hill, 3045 |  04501 123 456  |  haydensmith@email.com \nPage 1 \n \n \n(Tip: Name, mobile number and email address are essential. Current address could be included \nespecially if you live nearby. Ensure that it is clearly displayed) \nCareer Objective  \nI am reliable hard working Year 11 student seeking casual or part-time customer service work in a \nsports retail environment. Having played soccer for nine years and a keen all-round sports \nenthusiast, I am looking to contribute knowledge and proven communications skills.  \n \n(Tip: A career objective isn’t essential, but it’s useful if you don't have much experience and can \nconvey enthusiasm and motivation. Briefly summarise any work you have done, your strengths and \nrelevant expertise and state how you aim to apply this to your career goal. Adjust the statement to \nreflect the role you are applying for.)   \nAvailability \nMonday – Friday: 4.30pm – 10.00pm \nSaturday – Sunday: 8.00am – 11.00pm \n(up to 20 hours per week) \n \n(Tip: When looking for part-time casual work, it can be a good idea to include availability. If you’re a \nstudent, clearly state the maximum number of hours you are able to work per week.) \nKey Skills \n• \nCustomer service ability demonstrated when working efficiently in soccer club canteen. \n• \nNumeracy skills for cash handling tasks proven by achieving good results for mathematics \nsubjects.  \n• \nHighly developed communication skills shown by receiving positive feedback from \nsupervisors after completing work experience.  \n• \nStrong ability to work as part of a team developed through participating in soccer since the \nage of eight. \n• \nDemonstrated organisation skills as a result handing all assignments in on time. \n• \nAble to take responsibility and solve problems proven through umpiring and coaching.  \n \n (Tip: Include 5-9 key skills as bullet points that you like using and that are relevant to the role. When \napplying for advertised roles, match to any criteria listed in the advertisement. Use action words such \nas ‘demonstrated’ or ‘highly developed’ and then provide information about when, where and how \nyou’ve used the skill through your studies, work experience, volunteering, sporting activities, etc.) \nEducation \nCurrent  \n \nPark Hill Secondary College \n \nYear 11 \n• \nSubjects include: Maths, English, Business Management, VET studies in Sport and \nRecreation. \n \n(Tip: List your most recent education qualifications first including any relevant university degrees and \ncertificates. Professional development such as short training courses, workshops, licences, forms of \naccreditation, and other training can be included but is usually a separate heading.) \nWork Experience  \n \n \nHayden Smith \nPage 2 \n \nDecember 2016 – March 2017 \nPark Hill Soccer Club Canteen  \nCustomer service (volunteer) \n• \nServed customers. \n• \nHandled cash including operating of cash register. \n \nJune 2016 – February 2017 \nArgo Newsagency \n \n \nNewspaper deliverer \n• \nDelivered weekend newspapers to houses. \n \n(Tip: Focus on most recent work experience first. Include your job title, organisation name and dates. \nYears and months can be included. Include responsibilities and achievements for each role.) \nLeadership Roles  \n2016 – current  \n \n \n \nSoccer umpire for under 14 team \nPark Hill Soccer Club \n \n2017 – current  \n \n \n \nAssistant Coach for junior players \nPark Hill Soccer Club \n \n(Tip: Include any volunteering, community participation or leaderships roles.) \nInterests/Hobbies \n• \nPlayed soccer since the age of eight. \n• \nKeen spectator of soccer, football and cricket. \n \n(Tip: Including a section on interests can be useful if it’s relevant and active. Only include those \ninterests which are relevant to the job you are applying for or those which demonstrate your \nproactive or positive traits.)    \n \nReferees \nJohn Charles \nCoach \nHill Park Soccer Club \n0456 789 101 \nJohn_charles@hillpark.edu \nWendy Stevens \nYear 11 Coordinator \nHill Park Secondary College \n*Contact details available on request \n \n(Tip: If you decide to include referee contacts, notify the referee and indicate the type of roles that \nyou will be applying for. You may also want to provide them with a copy of your resume. You can \nalso simply write ‘Available on request’.)\n```"
    },
    {
        "filename": "resume_raw2.md",
        "content": "# Resume Text\n\n```\nSIDDHANT SINGH\n+91 7376151772\niamnotsiddhantsingh@gmail.com\nEDUCATION\nRV COLLEGE OF ENGINEERING\nDPS ELDECO, LUCKNOW\nBE Electronics and Instrumentation Engineering, CGPA : 8.73\nPCM CBSE, XII : 87.2\nSKILL\nProgramming Languages:\nPROJECTS\nPrixx – Placement Preparation Website (Ongoing Project)\nWorking as part of a team to develop \"Prixx,\" a platform designed to assist students in placement preparation.\nThe website features an AI-enabled resume builder, AI-powered interview simulations, a community chat\nsystem, and access to previous years' placement papers.\nAutonomous River Cleaning Bot\nDeveloped an Autonomous Water Body Cleaner as part of a hackathon project, aimed at improving water\nquality by detecting pollution levels and collecting floating waste. The system features a conveyor belt for\nefficient debris collection. Additionally, an Android application was integrated to provide real-time sensor\ndata, enabling remote monitoring and control.\nSmart Wearable Device for  Soilders\nDeveloped a smart wearable device for soldiers to enhance communication and health monitoring. The\ndevice integrates a LoRa module for secure message transmission between soldiers and headquarters, GPS\nfor accurate positioning, and an OLED screen to display messages and real-time sensor readings. Equipped\nwith multiple sensors, including body temperature, heartbeat, DHT, and gas sensors, the system ensures\ncontinuous health monitoring in the field.\nBengaluru, Karnataka\n2023 - 2027\n2020 - 2022\nDPS KALYANPUR, KANPUR 2012 - 2020\nCBSE, X : 86.2\nC++, Python, Django, HTML, CSS\nEmbedded Systems:\nArduino, ESP32\nDeveloped an automated concrete mixing system aimed at enhancing sustainability in construction by\nimproving concrete quality and reducing environmental impact. The system integrates fly ash, an industrial\nby-product, to enhance workability, reduce water demand, and increase durability while minimizing waste.\nAutomation ensures precise material measurement, reducing inconsistencies, dust pollution, and manual\nlabor in the mixing process. This innovation contributes to eco-friendly construction practices by optimizing\nresource utilization and improving long-term structural performance.\nAutomated concrete mixing system\nAutomatic Billing System\nDeveloped an Automatic Billing System using RFID technology to automate checkout, reducing wait times and\nimproving inventory management. The system scans products in real time, updating the bill automatically,\nenhancing efficiency in retail shopping.\n```"
    },
    {
        "filename": "resume_raw3.md",
        "content": "# Resume Text\n\n```\nFunctional Resume Sample \n \nJohn W. Smith  \n2002 Front Range Way Fort Collins, CO 80525  \njwsmith@colostate.edu \n \nCareer Summary \n \nFour years experience in early childhood development with a diverse background in the care of \nspecial needs children and adults.  \n  \nAdult Care Experience \n \n• Determined work placement for 150 special needs adult clients.  \n• Maintained client databases and records.  \n• Coordinated client contact with local health care professionals on a monthly basis.     \n• Managed 25 volunteer workers.     \n \nChildcare Experience \n \n• Coordinated service assignments for 20 part-time counselors and 100 client families. \n• Oversaw daily activity and outing planning for 100 clients.  \n• Assisted families of special needs clients with researching financial assistance and \nhealthcare. \n• Assisted teachers with managing daily classroom activities.    \n• Oversaw daily and special student activities.     \n \nEmployment History  \n \n1999-2002 \nCounseling Supervisor, The Wesley Center, Little Rock, Arkansas.    \n1997-1999 \nClient Specialist, Rainbow Special Care Center, Little Rock, Arkansas  \n1996-1997 \nTeacher’s Assistant, Cowell Elementary, Conway, Arkansas     \n \nEducation \n \nUniversity of Arkansas at Little Rock, Little Rock, AR  \n \n• BS in Early Childhood Development (1999) \n• BA in Elementary Education (1998) \n• GPA (4.0 Scale):  Early Childhood Development – 3.8, Elementary Education – 3.5, \nOverall 3.4.  \n• Dean’s List, Chancellor’s List\n```"
    },
    {
        "filename": "resume_raw4.md",
        "content": "# Resume Text\n\n```\nSAMPLE RESUMES \nMARY SMITH \nmsmith2@illinois.edu | 4004 Helix Lane Urbana, IL 61801 | (217) 765-3458 \nEDUCATION \nUniversity of Illinois at Urbana-Champaign \n \n \n \n \nMay 2021 \n \n \nBachelor of Science in Computer Science \n \n \n \n                \nGPA: 3.67/4.00 \n• \nDean’s List: Fall 2019, Spring 2020 \n \n \n \n \n \n• \nRelevant coursework: Database Systems, Program Verification, Scientific Visualization \nEXPERIENCE \nAon Corporation \n \n \n \n \n \n \n              Glenview, IL (remote) \nIT Intern  \n \n \n \n \n \n \n \n \nJune 2020-August 2020 \n• \nResponded to over 40 employees’ requests in order to assist with any computer malfunctioning problems \n• \nAided in developing a new software application by utilizing programming skills \n• \nContributed to reaching daily goals by expediting the reviewing process with a 99.5% accuracy rate  \nChicago Marketing Corporation  \n \n \n \n \n \nChicago, IL \nSales Assistant \n \n \n \n \n \n \n \n              June 2019-August 2019 \n• \nAssisted in developing and implementing integrated advertising plans which included newspaper, internet and \nalternative advertising sources \n• \nPlanned and participated in weekly meetings for a sales staff of over 50 representatives \n• \nCoordinated an office opening in Springfield, which subsequently generated over $315,000 in revenue and \n$57,000 in operating income   \nOutback Steakhouse \n \n \n \n \n \n \n \nHighland Park, IL \nServer  \n \n \n \n \n \n \n \n \nJune 2018-August 2018 \n• \nPromoted and implemented effective marketing campaigns for specific food items \n• \nTrained 15 new employees by teaching them necessary daily procedures to provide an enjoyable dining \nexperience for guests \n• \nProvided quality customer service by responding to customer needs promptly and efficiently \nACTIVITIES \nPanhellenic Council         \n \n \n \n \n \n \nChampaign, IL \nGreek Recruitment Counselor and Active Member \n \n \n \n \nAugust 2019-Present \n• \nReceive training in conflict management, decision making, and mentoring in order to effectively supervise 80+ \nwomen going through the formal recruitment process \n• \nPromote and participate in service events raising ~$15,000 for the Champaign Country Court \n• \nAppoint Special Advocates Program and Circle of Sisterhood Foundation \n• \nElected to scholarship committee in order to oversee chapter’s weekly participation in study hours and maintain \nknowledge about campus tutoring and academic assistance programs \nIllinois Leadership Center, Leadership Certificate  \n \n \n \nChampaign, IL \n \nActive Participant \n \n \n \n \n \n \n \nJanuary 2018-Present \n• \nDevelop leadership skills in self, organizational and interpersonal settings through experiential learning under the \nguidance of a Leadership Coach \n• \nAugment critical insight into intrapersonal and interpersonal skills through innovative leadership \nretreats/workshops \nSKILLS  \nComputer \n• \nC++ (Advanced), Adobe Photoshop (Intermediate), HTML (Basic) \n \n \nJooEun Li \n1542 Maple Avenue Chicago, IL 60606 | (312) 555-7356 | jooeunli@gmail.com \nEDUCATION \n \nUniversity of Illinois at Urbana-Champaign  \n \n \n                                     May 2021 \nBachelor of Arts in International Studies with a Minor in Business \n \n                 Major GPA: 3.57/4.00 \n• Leadership Certificate \n \n \n \n \n                 Completed: May 2020 \nOakton Community College, Des Plains, IL  \n \n \n \n                 May 2018 \nAssociate of Arts in Global Business Studies \n \n \n \n \n        GPA: 3.92/4.00 \n \nINTERNATIONAL EXPERIENCE \n \nInternational Business Immersion Program  \n \n \n \n    Munich, Germany \nParticipant  \n \n \n \n \n \n \n                 May 2019 \n• Analyzed the firm, channel, and industry dynamics within the European agricultural food sector \n• Expanded global perspective through speaking with top management, touring farms and factories \n \nIES Shanghai Study Abroad Center \n \n \n \n \n       Shanghai, China \nAmerican-Chinese Student Liaison  \n \n \n \n              January 2018-May 2018 \n• Facilitated and hosted several roundtable sessions between American and Chinese students on topics such as \ncomparative political thought and disparities in philosophical traditions \n• Adjusted to cultural differences during the planning phases by utilizing a step-by-step approach, allowing \nboth sides to first understand and then solve an issue \n \nWORK EXPERIENCE \nBusey Hall University Housing \n \n \n \n \n \n               Urbana, IL \nResident Advisor \n \n \n \n \n \n                    August 2019-Present \n• Cooperated with 11 Resident Advisors, three Program Advisors, and the Multicultural Advocate to plan \ncommunity programs \n• Developed events to educate students about various opportunities and resources available on campus \n• Co-hosted “Health Sundays”, a weekly program designed to educate over 500 resident hall members about \nmatters concerning health awareness \n \nIllinois State Board of Education   \n \n \n \n \n         Springfield, IL \nResearch Assistant \n \n \n \n \n \n              June 2019-August 2019 \n• Devised methods and researched data for further studies of language development \n• Transcribed relevant data for the primary researchers, interacted daily with research subjects, and assisted \nfacilitators in the experiments by responding to pressing requests \n \nACTIVITIES \nIllini Union Board \n \n \n \n \n \n \n               Urbana, IL \nCommittee Chair for Diversity \n \n \n \n \n        November 2019-May 2020 \n• Organized and facilitated monthly conferences for 100-300 students that encouraged an appreciation for \ndiversity \n• Chaired committee of 6-10 members by guiding them on advertising programs on campus  \n \nUniversity of Illinois Buddy Program \n \n \n \n \n               Urbana, IL \nActive Member \n \n \n \n \n \n             August 2018-May 2019 \n• Communicated with incoming freshmen through the year to facilitate smooth transition into the University \n• Served as a peer mentor for over 15 students and provided advice and insight based on personal experiences \n \nSKILLS \nLanguages: Mandarin (Fluent), French (Functional) \n \nGregory Johnson \n302 East John Street #1904 Champaign, Illinois 61820 | (773) 347-7782 | gjohns5@illinois.edu \nEDUCATION \nUniversity of Illinois at Urbana-Champaign \n \n \n       Graduation Date: May 2021 \nBachelor of Science in Marketing \n                            \n \n                Major GPA: 3.66/4.00 \nESCP Europe-Paris Study Abroad \n \n \n \n             January 2019-May 2019 \nHONORS \nCaterpillar Excellence and Glenn Winokur Scholarships, Recipient         \n                       July 2019-Present \nHonors Business Program Class of 2014, Student \n \n \n                  August 2018-Present \nLeadership, Education and Development Program (LEAD), Program Participant \n    July 2017-Present \nRELEVANT EXPERIENCE \n \nNamasté Laboratories \n \n \n \n \n              Blue Island, IL (remote) \nMarketing Communication Intern \n \n \n \n              May 2020-August 2020 \n• Created and edited internal and external press releases about the company’s recent events and involvements \n• Compiled spending reports and advertising print media in order to analyze industry competition and ranks \nMarketing Professional Brand Coordinator \n \n \n             June 2019-August 2019 \n• Developed and edited consumer brochures and sell sheets to target salon stylists and consumers \n• Analyzed annual product sales at various retail stores and salons by creating spreadsheets and graphs \nChampaign-Urbana Radio Group \n \n \n \n                          Champaign, IL \nEvent Marketing Intern \n \n \n \n                  September 2018-December 2018 \n• Performed tasks leading up to the execution of events coordinated with Radio Group and other venues or \ncompanies \n• Promoted a contest and event by appearing at a live radio broadcast and talking to over 200 local residents \nADDITIONAL EXPERIENCE \nCollege of Business MBA Office \n \n \n \n \n       Champaign, IL \nStudent and Academic Services Office Assistant \n \n \n                 August 2018-Present \n• Produce flyers, newsletters and announcements for events and opportunities available to MBA students \n• Organize and store data and records for MBA students as well as effectively answer students’ questions to \nensure clarity \n \nLEADERSHIP & ACTIVITIES \nAmerican Marketing Association \n \n \n   \n \n       Champaign, IL \nNewsletter Committee Associate, Small Business Consulting Committee \n                 August 2019-Present \n• Write articles for the monthly newsletter, informing members about campus events, opportunities and \nsuggestions \n• Assist with small business consulting committee aiding in local small business marketing projects \n \nNational Black MBA Association \n \n \n \n \n       Champaign, IL \nVice President of Communications, Social Chair \n \n \n                January 2019-Present \n• Communicate messages to the entire organization about upcoming events, meetings and opportunities \n• Raise over $950 for the association’s Fall 2014 national conference while serving as a staff manager \n \nManagement Leadership for Tomorrow (MLT) \n \n \n \n        New York, NY \nCareer Preparation Fellow  \n \n \n \n \n                July 2018 \n• Invited as one of 200 applicants selected to prepare for a successful career through workshops and training, \none on one coach calls and extensive weekly assignments \n• Expanded network and opportunities by establishing relationships with recruiters, peers and alumni \n \nBusiness 101 Section Leader \n \n \n           \n \n       Champaign, IL \nTeaching Assistant \n \n \n \n                       March 2018-December 2018 \n• Facilitated group discussions among freshmen in the College of Business about various business modules \n• Monitored over 30 students by assisting with their transition to the university\n```"
    },
    {
        "filename": "resume_raw5.md",
        "content": "# Resume Text\n\n```\nSonia Rashid\nDavis, CA | smrashid@ucdavis.edu | (123) 456-789 | linkedin.com/soniarashid\nEDUCATION\nUniversity of California, Davis\n                 Expected Graduation: Spring 2024\nBachelor of Science, Aerospace Science and Engineering                             \n     \n             GPA: 3.5/4.0\nBachelor of Science, Mechanical Engineering | Minor: History             \n                     \n        \n●\nDean’s Honor List, Spring 2022\n●\nRelevant Coursework: Statics, Properties of Materials, Mechanics of Materials, Fluid Mechanics.\nRELEVANT EXPERIENCE\nTeam Lead\n    September 2021 - September 2022\nUC Davis AeroBrick\n               \n    Davis, CA\n●\nLed a team of 8 through weekly meetings and the aircraft design process for the Society of Automotive \nEngineers Aero Design West competition.\n●\nCoordinated and delegated tasks for team members and assigned each member to work on a component of the \nplane (fuselage, empennage, etc.)\n●\nBrainstormed conceptual ideas and prototyped components using AutoCAD 3D modeling software to create a \nheavy lift aircraft that met the regulations of the competition.\n●\nResearched and compared manufacturing techniques to determine the most efficient and cost effective strategy \nfor final production.\n●\nWorked as a team to solve a variety of problems that arose when designing, assembling or testing the heavy lift \naircraft.\nRESEARCH EXPERIENCE \nUndergraduate Researcher  \n                               September 2019 – Present \nUC Davis Department of Chemical Engineering\n                    \n    Davis, CA\n●\nExpedite construction of a prototype concentration sensor by analyzing ambient noise reductions compared to \nan old sensor, improving signal to noise ratio by 89%.\n●\nSterilize laboratory equipment by following proper lab safety procedures to mitigate risk.\n●\nPerform daily experiments with graduate student peers by setting up procedures in the glove box and \ntabulating results into Excel workbooks.\n●\nPresent results in comprehensible slides to 10+ professors and graduate students, procuring a $1000 grant for \nthe research laboratory.\nOTHER WORK EXPERIENCE\n                          \nFine Dining Server\n                       May 2022 – Sept 2022\nAsiago’s Restaurant and Bar\n \n     \n       Sacramento, CA            \n●\nServed a 12-table section, managing 5-course meals and large parties while delivering a luxury dining \nexperience for patrons.\n●\nPerformed tableside bottle service. Mixed cocktails, and prepared wine, beer, and hot drinks. Ensuring quick \nand personalized service. \n●\nMaintained an extensive knowledge of seasonal dinner menus and monthly wine offerings.\n●\nPromoted specialty items, wine pairings, and providing personalized recommendations to increase guest check \naverages.\nSKILLS\nTechnical: SolidWorks, AutoCAD, MATLAB, C++, Google Workspace, Microsoft Office\n```"
    },
    {
        "filename": "resume_raw6.md",
        "content": "# Resume Text\n\n```\nJiaming Chen\njiachen@ucdavis.edu | Davis, CA | (345) 678-9101 | linkedin.com/jiamingchen\nEDUCATION\nUniversity of California, Davis\n  \n                           Davis, CA\nBachelor of Science in Computer Science | GPA: 3.2/4.0\n     \n                 Expected Graduation: June 2024\nRelevant Coursework: Introduction to Probability Theory, Algorithm Design and Analysis, Computer Organization \n& Machine-Dependent Programming, Software Development in UNIX & C++\nSKILLS\n●\nComputer: Proficient in R, MATLAB, C++, Advanced Proficiency in Java, Python, NodeJS, ReactJS, \nChart.js, HTML, CSS \n●\nSoftware: LINUX, Windows, MacOS\n●\nLanguages: Fluent in English, Spanish, and Mandarin\nWORK EXPERIENCE\nSoftware Engineering Intern, Oracle Cloud Infrastructure, Compute Imaging DP          June 2022 - September 2022\n●\nUtilized Swagger Spec to build an API Client for Oracle’s Instance Agent Admin Service.\n●\nRedesigned and rebuilt current Agent Admin tool with ReactJs in tandem with Oracle Forge to implement \nRole Based Access Control.\nSoftware Engineering Intern, Oracle Cloud Infrastructure, EADevOps                           June 2021 - September 2021\n●\nDeveloped foundation in Java to create test cases for and debug an Automation Testing Framework.\n●\nIntegrated Real-Time User Monitoring with test applications to conduct R&D for future use within the \nEADevOps team.\n●\nDesigned and developed web application using ReactJS for Front-end and NodeJS for Back-end to automate \nJenkins job creation process.\nPROJECTS\nTemperature Regulated Pet House, Intro to Engineering Design, UC Davis   September 2022 - December 2022 \n●\nDeveloped an enclosure for animals fitted with an automated cooling system to combat the effects of rising \ntemperatures on animals. \n●\nFormulated a logic flowchart and wrote C++ code for the Arduino to run effectively based on temperature \nfluctuations.\n●\nPresented final poster and prototype to convey purpose and solution to engineering professionals and peers.\nBattleship, Object-Oriented Programming, Personal Project\n        April 2021 - June 2021\n●\nRecreated the game of Battleship to demonstrate Inheritance and Polymorphism.\n●\nIncorporated the Linux Operating System Terminal to serve as the User Interface.\n●\nDebugged errors and segmentation faults to ensure consistency and avoid memory leaks.\nORGANIZATIONS\nLeadership in Engineering Advancement Diversity and Retention (LEADR) \n    September 2019 – Present\nStudent Ambassador, University of California, Davis, CA\n●\nProvide mentorship and organize social events to assist underrepresented freshman engineering majors  \ntransition to a University.\n●\nProvide programming tutoring for 1st and 2nd year students in order to stimulate creativity and solidify \nfundamental concepts.\n```"
    },
    {
        "filename": "resume_raw7.md",
        "content": "# Resume Text\n\n```\nKarla Romero\n Davis, CA | kmromero@ucdavis.edu | (510) 565-8345\nlinkedin.com/karlaromero\nOBJECTIVE: Fourth year chemistry student seeking an entry level position as a fermentation technician.\nEDUCATION \nUniversity of California, Davis\n Davis, CA\nBachelor of Science in Chemistry \n  Expected Graduation: June 2025\nMinor in Environmental Toxicology                                                                 Cumulative GPA: 3.42/4.00\nRelevant Coursework: Organic Chemistry + Lab, Physical Chemistry, Environmental Toxicology, \nEnvironmental Science and Policy, Chemistry and Material Science\nSKILLS\nLaboratory Skills: Thermogravimetric Analysis, Solid-State Synthesis, Centrifuging, Sterilization, \nSpectrometer Analysis, Cell Culture Growth and Analysis, IR Spectroscopy\nTechnical Skills: Python, R Studio, MATLAB, ANOVA Analysis, ChemDraw, MestReNova\nRELEVANT EXPERIENCE\nUndergraduate Researcher\n  \n                     April 2020 - Present \nDepartment of Viticulture and Enology at UC Davis\n  Davis, CA\n-\nConduct daily laboratory experiments by centrifuging 8 vials of protein molecules to prep chemistry \nfor downstream processing and analysis\n-\nCollaborate with a team of 5 researchers to assess daily safety protocols and review sterilization \nprocedures and maintain a safe laboratory environment\n-\nCompile and organize data from 300+ academic journal articles in MATLAB to analyze safety trends\n-\nPresent weekly results to 10+ professors, creating a connected network and developing \ncommunication skills\nToxicology Intern\n \n                    October 2018 - January 2020\nMerck Testing Inc.\n    Sacramento, CA\n-\nWrote weekly toxicology risk evaluation reports summarizing findings of current research from 14 \nlaboratory technicians\n-\nDesigned and evaluated laboratory SOPs to assess potential biological hazards in compost materials\n-\nCollected organic matter samples to interpret data to evaluate feasibility and desire of future \nexperiments, resolving the research hypothesis in the process\nACTIVITIES\nExternal Vice President - ACS Chemistry Club, UC Davis\n September 2021 - Present\nVolunteer - Academic Tutoring , UC Davis\n```"
    },
    {
        "filename": "resume_raw8.md",
        "content": "# Resume Text\n\n```\nThis section shows how students can take their experience and improve the bullets into more\ndetailed accomplishment statements.\nExperiences:\nBefore:\nUndergraduate Researcher – Shah Lab\nSeptember 2019 – Present\n●\nHelped build a prototype sensor\n●\nCleaned glassware and helped the graduate students in their work\n●\nPut together slides that were presented to the team\nAfter:\nUndergraduate Researcher\nSeptember 2019 – Present\nDepartment of Chemical Engineering\nDavis, CA\n●\nExpedite construction of a prototype concentration sensor by analyzing ambient noise\nreductions compared to an old sensor, improving signal to noise ratio by 89%\n●\nSterilize laboratory equipment by following proper lab safety procedures to mitigate risk\n●\nPerform daily experiments with graduate student peers by setting up procedures in the glove\nbox and tabulating results into Excel workbooks\n●\nPresent results in comprehensible slides to 10+ professors and graduate students, procuring a\n$1000 grant for the research laboratory\nBefore:\nProcess Engineering Intern\nJune 2021 - September 2021\nTokyo Electron Limited\nAustin, TX\n●\nManaged semiconductor processes\n●\nAssisted in manufacturing wafers and testing them with different chemicals\n●\nTabulated data in Excel and coded it into graphs\nAfter:\nProcess Engineering Intern\nJune 2021 - September 2021\nTokyo Electron Limited\nAustin, TX\n●\nManaged upstream strategies of semiconductor processes by coordinating wafer to deposition\ntimings, increasing manufacturing efficiency by 120%\n●\nStudied the impact of atomic layer deposition (ALD) of zirconium onto wafers and characterized\nthe results utilizing Python\n●\nTabulated data from ALD deposition methods into Excel and presented created figures of the\ndeposition efficiency to an engineering team of 20\n```"
    },
    {
        "filename": "resume_raw9.md",
        "content": "# Resume Text\n\n```\nJamar Jackson\njjackson@ucdavis.edu | Sacramento, California 95819 | (916) 555-4673\nOBJECTIVE\nA laboratory research internship with BioMarin Pharmaceutical, Inc.\nEDUCATION\nBachelor of Science in Biological Sciences, Expected June 2025\nUniversity of California, Davis\nGPA: 3.67/4.00\nRelated Coursework: General Chemistry (Lab), Organic Chemistry (Lab), Genes and Gene Expression, Structure &\nFunction of Biomolecules, Introduction to Evolution, Molecular and Cellular Biology of Plants, Cell Signaling in Health\n& Disease, Neurobiology Laboratory (Lab), Applied Statistical Methods: Regression Analysis\nSKILLS\nLab: PCR, microscopy, gel electrophoresis, SDS-PAGE, restriction enzyme digest, pipetting, serial dilution\nComputer: Microsoft Word, Excel, PowerPoint, Google Docs\nLanguages: Python (Beginner), R (Proficient)\nRESEARCH EXPERIENCE\nUndergraduate Research Assistant, Dept. of Microbiology and Molecular Genetics, UC Davis\nMarch 2022 - Present\n●\nExplore the interactions between Entamoeba histolytica and the human host in order to elucidate mechanisms of\namoebic trogocytosis\n●\nCulture microbes in liquid culture and utilize microscopy techniques to examine trogocytosis over time\n●\nPerform a restriction enzyme digest with fellow undergraduate in order to create a plasmid containing the trigger\ngene and clone them in microbial cells\n●\nVerify the presence of the trigger gene with PCR and gel electrophoresis to ensure successful cloning\n●\nTroubleshoot issues within the project by communicating with fellow lab members and seeking various solutions\n●\nPresent on scientific papers related to ongoing projects during journal club and stimulate meaningful conversation\nSPECIAL PROJECT\nUsing AI to Study Human Genetic Diseases, UC Davis\nSept 2023 - Dec 2023\n●\nCollaborated with two classmates to compile list of mutated genes in Alzheimer’s in order to find common and\nrare associated proteins for our project\n●\nVisualized protein structures of normal and mutated isoforms of the protein PSEN1, MAPT, and APLP1 using\nAlphaFold2 and presented results with the class in an engaging PowerPoint\nOTHER EXPERIENCE\nShift Leader, In-N-Out Burger, Davis, CA\nOct 2022 - Present\n●\nProvide outstanding customer service and handled customer complaints effectively\n●\nTrain and supervise ten staff members, providing feedback for areas of growth in order to strengthen team\n●\nMaintain accurate inventory count of all products to ensure smooth running of business\n●\nUphold proper food sanitation standards by strictly adhering to all food handling safety protocols\nACTIVITIES\nVolunteer, Yolo County SPCA, Davis, CA, Apr 2022 - present\nActivities Coordinator, Black Student Association, UC Davis, Sep 2021 - present\n```"
    }
]